<a href="https://colab.research.google.com/github/eumoas/Data-Engineer/blob/main/PROJETOINDIVIDUAL_MIRIAM.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**## PROJETO INDIVIDUAL MIRIAM SOBRAL - CAMPANHA MARKETING **

PROJETO DESTINADO À AVALIAÇÃO DE DESEMPENHO DO CURSO DE ENGENHARIA DE DADOS - SOULCODE ACADEMY 
TURMA: BC12
PROFs: IGOR GONDIM E BISMARK WILLIAM
DATA DA ENTREGA: 20.03.22

## 1 - NÍVEL INFRAESTRUTURA

A)O Dataset deve ser salvo em ambiente cloud(Cloud Storage)

B)O arquivo original e tratado deve ser salvo em MongoDB Atlas em coleções diferentes

C)Os DataFrames devem ser obrigatoriamente salvos em uma bucket do CloudStorage

In [ ]:
!pip install pyspark

In [ ]:
!pip install gcsfs

In [ ]:
from pyspark.sql import SparkSession
from pyspark import SparkConf
import pyspark.sql.functions as F
import pandas as pd
from google.cloud import storage
import os
from pyspark.sql.types import StructType, StructField, StringType, IntegerType
from pyspark.sql.types import *
from pyspark.sql.window import Window

*CONEXÃO DATASET - COLAB >>>>>> GCP*

In [ ]:

#A
path = 'https://storage.googleapis.com/soulcodeprojeto/marketing_campaign.csv'

df_pandas = pd.read_csv(path)

CONEXÃO DATASET - COLAB >>>>>> MONGO DB

In [ ]:
pip install pandera

In [ ]:
pip install pymongo[srv]

In [ ]:
import pandas as pd
import pandera as pa
import numpy as np
import pymongo
from pymongo import MongoClient

In [ ]:
#B


client = pymongo.MongoClient('mongodb+srv://miriamgds:delete@cluster0.tx4pn.mongodb.net/myFirstDatabase?retryWrites=true&w=majority')

In [ ]:
db = client['basesoriginais']
ds_original = db.dataset_originais

In [ ]:
spark = (
    SparkSession.builder
                .master('local')
                .appName('aulaSpark')
                .config('spark.ui.port', '4050')
                .getOrCreate()
)
df_spark = spark.createDataFrame(df_pandas)

In [ ]:
#C Confirmação por email

## 2 - NÍVEL PANDAS 


A) Realizar a extração corretamente para um dataframe

B) Traduzir para Português-BR

C) Verificar a existência de dados inconsistentes e realizar a limpeza para NaN ou NA

D) Realizar o drop(se necessário) de colunas do dataframe realizando o comentário do porque da exclusão 

E) Todos os passos devem ser comentados

In [ ]:

path = 'https://storage.googleapis.com/soulcodeprojeto/marketing_campaign.csv'

df_pandas = pd.read_csv(path)

In [ ]:
#A

df_pandas

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [ ]:
df_pandas.dtypes

ID                       int64
Year_Birth               int64
Education               object
Marital_Status          object
Income                 float64
Kidhome                  int64
Teenhome                 int64
Dt_Customer             object
Recency                  int64
MntWines                 int64
MntFruits                int64
MntMeatProducts          int64
MntFishProducts          int64
MntSweetProducts         int64
MntGoldProds             int64
NumDealsPurchases        int64
NumWebPurchases          int64
NumCatalogPurchases      int64
NumStorePurchases        int64
NumWebVisitsMonth        int64
AcceptedCmp3             int64
AcceptedCmp4             int64
AcceptedCmp5             int64
AcceptedCmp1             int64
AcceptedCmp2             int64
Complain                 int64
Z_CostContact            int64
Z_Revenue                int64
Response                 int64
dtype: object

In [ ]:
df_pandas.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0

In [ ]:
#B 
#Renomeando o dataframe do inglês para o português br.


df_pandas.rename(columns={'ID':'ID do cliente', 'Year_Birth':'Nascimento', 'Education':'Grau de instrução', 
                                      'Marital_Status':'Estado Civil', 'Income':'Renda Familiar Anual do Cliente', 
                                      'Kidhome':'Número de filhos pequenos', 'Teenhome':'Número de adolescentes',
                                      'Dt_Customer':'Data do cadastro do cliente na empresa', 
                                      'Recency':'Número de dias desde a última compra do cliente', 
                                      'MntWines':'Valor gasto em vinho nos últimos 2 anos',
                                      'MntFruits':'Valor gasto em frutas nos últimos 2 anos', 
                                      'MntMeatProducts':'Valor gasto em carnes nos últimos 2 anos', 
                                      'MntFishProducts':'Valor gasto em pescado nos últimos 2 anos', 
                                      'MntSweetProducts':'Valor gasto em doces nos últimos 2 anos', 
                                      'MntGoldProds':'Valor gasto em ouro nos últimos 2 anos', 
                                      'NumDealsPurchases': 'Número de compras feitas com desconto', 
                                      'NumWebPurchases': 'Número de compras realizadas através do site da empresa', 
                                      'NumCatalogPurchases':'Número de compras feitas usando um catálogo', 
                                      'NumStorePurchases': 'Número de compras feitas diretamente nas lojas', 
                                      'NumWebVisitsMonth': 'Número de visitas ao site da empresa no último mês', 
                                      'AcceptedCmp3': 'Campanha 3 = 1 se o cliente aceitou a oferta na 3ª campanha, 0 caso contrário', 
                                      'AcceptedCmp4':'Campanha 4 = 1 se o cliente aceitou a oferta na 4ª campanha, 0 caso contrário', 
                                      'AcceptedCmp5':'Campanha 5 = 1 se o cliente aceitou a oferta na 5ª campanha, 0 caso contrário', 
                                      'AcceptedCmp1': 'Campanha 1 = 1 se o cliente aceitou a oferta na 1ª campanha, 0 caso contrário',
                                      'AcceptedCmp2': 'Campanha 2 = 1 se o cliente aceitou a oferta na 2ª campanha, 0 caso contrário', 
                                      'Complain': 'Reclamação: 1 se o cliente reclamou nos últimos 2 anos, 0 caso contrário',
                                      'Z_CostContact': 'Z_CostContact',
                                      'Z_Revenue': 'Z_Revenue', 
                                      'Response':'Resposta'},inplace=True)

In [ ]:
#Traduzir dataset inteiro para o português

In [93]:
df_pandas.head(2)

,ID do cliente,Nascimento,Grau de instrução,Estado Civil,Renda Familiar Anual do Cliente,Número de filhos pequenos,Número de adolescentes,Data do cadastro do cliente na empresa,Número de dias desde a última compra do cliente,Valor gasto em vinho nos últimos 2 anos,...,Número de visitas ao site da empresa no último mês,"1 se o cliente aceitou a oferta na 3ª campanha, 0 caso contrário","1 se o cliente aceitou a oferta na 4ª campanha, 0 caso contrário","1 se o cliente aceitou a oferta na 5ª campanha, 0 caso contrário","1 se o cliente aceitou a oferta na 1ª campanha, 0 caso contrário","1 se o cliente aceitou a oferta na 2ª campanha, 0 caso contrário","Reclamação: 1 se o cliente reclamou nos últimos 2 anos, 0 caso contrário",Z_CostContact,Z_Revenue,Resposta
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0

In [ ]:
#C 
#Limpeza para NaN ou NA
#retornar um resumo estatístico das variáveis numéricas

df_pandas.describe()

In [ ]:
#Resumo de valores não-nulos encontrados


df_pandas.info()

In [ ]:
#Soma dos valores nulos encontrados

df_pandas.isnull().sum()

ID do cliente                                                                0
Nascimento                                                                   0
Grau de instrução                                                            0
Estado Civil                                                                 0
Renda Familiar Anual do Cliente                                             24
Número de filhos pequenos                                                    0
Número de adolescentes                                                       0
Data do cadastro do cliente na empresa                                       0
Número de dias desde a última compra do cliente                              0
Valor gasto em vinho nos últimos 2 anos                                      0
Valor gasto em frutas nos últimos 2 anos                                     0
Valor gasto em carnes nos últimos 2 anos                                     0
Valor gasto em pescado nos últimos 2 anos                                    0
Valor gasto em doces nos últimos 2 anos                                      0
Valor gasto em ouro nos últimos 2 anos                                       0
Número de compras feitas com desconto                                        0
Número de compras realizadas através do site da empresa                      0
Número de compras feitas usando um catálogo                                  0
Número de compras feitas diretamente nas lojas                               0
Número de visitas ao site da empresa no último mês                           0
1 se o cliente aceitou a oferta na 3ª campanha, 0 caso contrário             0
1 se o cliente aceitou a oferta na 4ª campanha, 0 caso contrário             0
1 se o cliente aceitou a oferta na 5ª campanha, 0 caso contrário             0
1 se o cliente aceitou a oferta na 1ª campanha, 0 caso contrário             0
1 se o cliente aceitou a oferta na 2ª campanha, 0 caso contrário             0
Reclamação: 1 se o cliente reclamou nos últimos 2 anos, 0 caso contrário     0
Z_CostContact                                                                0
Z_Revenue                                                                    0
Resposta                                                                     0
dtype: int64

In [ ]:
 #Mostrar as 10 colunas com mais valores ausentes para esse dataset

df_pandas.isnull().sum().sort_values(ascending=False)[:10]

Renda Familiar Anual do Cliente                                             24
ID do cliente                                                                0
Número de compras feitas com desconto                                        0
Z_Revenue                                                                    0
Z_CostContact                                                                0
Reclamação: 1 se o cliente reclamou nos últimos 2 anos, 0 caso contrário     0
1 se o cliente aceitou a oferta na 2ª campanha, 0 caso contrário             0
1 se o cliente aceitou a oferta na 1ª campanha, 0 caso contrário             0
1 se o cliente aceitou a oferta na 5ª campanha, 0 caso contrário             0
1 se o cliente aceitou a oferta na 4ª campanha, 0 caso contrário             0
dtype: int64

In [ ]:
#D 
#Dropando colunas

df_pandas.groupby(['Nascimento']).Nascimento.count()

Nascimento
1893     1
1899     1
1900     1
1940     1
1941     1
1943     7
1944     7
1945     8
1946    16
1947    16
1948    21
1949    30
1950    29
1951    43
1952    52
1953    35
1954    50
1955    49
1956    55
1957    43
1958    53
1959    51
1960    49
1961    36
1962    44
1963    45
1964    42
1965    74
1966    50
1967    44
1968    51
1969    71
1970    77
1971    87
1972    79
1973    74
1974    69
1975    83
1976    89
1977    52
1978    77
1979    53
1980    39
1981    39
1982    45
1983    42
1984    38
1985    32
1986    42
1987    27
1988    29
1989    30
1990    18
1991    15
1992    13
1993     5
1994     3
1995     5
1996     2
Name: Nascimento, dtype: int64

In [ ]:
## Extrair a mediana da Renda Anual 
#renda_mediana = df_pandas.Renda_Familiar_Anual_do_Cliente.median()

In [ ]:
# preencher a coluna  com a mediana
#df.fillna(lotFrontage_mediana, inplace=True)

In [ ]:
# checar se há valor ausente
df.LotFrontage.isnull().sum()

In [ ]:
df_pandas.groupby(['Renda Familiar Anual do Cliente']).size().sort_values(ascending=False)

Renda Familiar Anual do Cliente
7500.0      12
35860.0      4
18929.0      3
18690.0      3
37760.0      3
            ..
42081.0      1
42033.0      1
42021.0      1
42011.0      1
666666.0     1
Length: 1974, dtype: int64

# 3 - NÍVEL PYSPARK

A) Deverá ser montada a estrutura do DataFrame utilizando o StructType.

B) Verificar a existência de dados inconsistentes, nulos e realizar a limpeza.

C) Verificar a necessidade de drop em colunas ou linhas. Caso seja necessário, fazer comentário do porque.

D) Realizar a mudança de nome de pelo menos 2 colunas.

E) Deverá criar pelo menos duas novas colunas contendo alguma informação relevante sobre as outras colunas já existentes (Funções de Agrupamento, Agregação ou Joins). (Use a sua capacidade analítica)

F) Deverá utilizar filtros, ordenação e agrupamento, trazendo dados relevantes para o negócio em questão. (Use a sua capacidade analítica)

G) Utilizar pelo menos duas Window Functions

In [ ]:
#A)

spark = (
    SparkSession.builder
                .master('local')
                .appName('StructType')
                .config('spark.ui.port', '4050')
                .getOrCreate()
)
df1_spark = spark.createDataFrame(df_pandas)

In [ ]:
df1_spark.show()

+-------------+----------+-----------------+------------+-------------------------------+-------------------------+----------------------+--------------------------------------+-----------------------------------------------+---------------------------------------+----------------------------------------+----------------------------------------+-----------------------------------------+---------------------------------------+--------------------------------------+-------------------------------------+-------------------------------------------------------+-------------------------------------------+----------------------------------------------+--------------------------------------------------+----------------------------------------------------------------+----------------------------------------------------------------+----------------------------------------------------------------+----------------------------------------------------------------+----------------------------------------------------------------+------------------------------------------------------------------------+-------------+---------+--------+
|ID do cliente|Nascimento|Grau de instrução|Estado Civil|Renda Familiar Anual do Cliente|Número de filhos pequenos|Número de adolescentes|Data do cadastro do cliente na empresa|Número de dias desde a última compra do cliente|Valor gasto em vinho nos últimos 2 anos|Valor gasto em frutas nos últimos 2 anos|Valor gasto em carnes nos últimos 2 anos|Valor gasto em pescado nos últimos 2 anos|Valor gasto em doces nos últimos 2 anos|Valor gasto em ouro nos últimos 2 anos|Número de compras feitas com desconto|Número de compras realizadas através do site da empresa|Número de compras feitas usando um catálogo|Número de compras feitas diretamente nas lojas|Número de visitas ao site da empresa no último mês|1 se o cliente aceitou a oferta na 3ª campanha, 0 caso contrário|1 se o cliente aceitou a oferta na 4ª campanha, 0 caso contrário|1 se o cliente aceitou a oferta na 5ª campanha, 0 caso contrário|1 se o cliente aceitou a oferta na 1ª campanha, 0 caso contrário|1 se o cliente aceitou a oferta na 2ª campanha, 0 caso contrário|Reclamação: 1 se o cliente reclamou nos últimos 2 anos, 0 caso contrário|Z_CostContact|Z_Revenue|Resposta|
+-------------+----------+-----------------+------------+-------------------------------+-------------------------+----------------------+--------------------------------------+-----------------------------------------------+---------------------------------------+----------------------------------------+----------------------------------------+-----------------------------------------+---------------------------------------+--------------------------------------+-------------------------------------+-------------------------------------------------------+-------------------------------------------+----------------------------------------------+--------------------------------------------------+----------------------------------------------------------------+----------------------------------------------------------------+----------------------------------------------------------------+----------------------------------------------------------------+----------------------------------------------------------------+------------------------------------------------------------------------+-------------+---------+--------+
|         5524|      1957|       Graduation|      Single|                        58138.0|                        0|                     0|                            04-09-2012|                                             58|                                    635|                                      88|                                     546|                                      172|                                     88|                                    88|                                    3|                                                      8|                                         10|                                             4|                                                 7|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       1|
|         2174|      1954|       Graduation|      Single|                        46344.0|                        1|                     1|                            08-03-2014|                                             38|                                     11|                                       1|                                       6|                                        2|                                      1|                                     6|                                    2|                                                      1|                                          1|                                             2|                                                 5|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|
|         4141|      1965|       Graduation|    Together|                        71613.0|                        0|                     0|                            21-08-2013|                                             26|                                    426|                                      49|                                     127|                                      111|                                     21|                                    42|                                    1|                                                      8|                                          2|                                            10|                                                 4|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|
|         6182|      1984|       Graduation|    Together|                        26646.0|                        1|                     0|                            10-02-2014|                                             26|                                     11|                                       4|                                      20|                                       10|                                      3|                                     5|                                    2|                                                      2|                                          0|                                             4|                                                 6|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|
|         5324|      1981|              PhD|     Married|                        58293.0|                        1|                     0|                            19-01-2014|                                             94|                                    173|                                      43|                                     118|                                       46|                                     27|                                    15|                                    5|                                                      5|                                          3|                                             6|                                                 5|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|
|         7446|      1967|           Master|    Together|                        62513.0|                        0|                     1|                            09-09-2013|                                             16|                                    520|                                      42|                                      98|                                        0|                                     42|                                    14|                                    2|                                                      6|                                          4|                                            10|                                                 6|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|
|          965|      1971|       Graduation|    Divorced|                        55635.0|                        0|                     1|                            13-11-2012|                                             34|                                    235|                                      65|                                     164|                                       50|                                     49|                                    27|                                    4|                                                      7|                                          3|                                             7|                                                 6|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|
|         6177|      1985|              PhD|     Married|                        33454.0|                        1|                     0|                            08-05-2013|                                             32|                                     76|                                      10|                                      56|                                        3|                                      1|                                    23|                                    2|                                                      4|                                          0|                                             4|                                                 8|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|
|         4855|      1974|              PhD|    Together|                        30351.0|                        1|                     0|                            06-06-2013|                                             19|                                     14|                                       0|                                      24|                                        3|                                      3|                                     2|                                    1|                                                      3|                                          0|                                             2|                                                 9|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       1|
|         5899|      1950|              PhD|    Together|                         5648.0|                        1|                     1|                            13-03-2014|                                             68|                                     28|                                       0|                                       6|                                        1|                                      1|                                    13|                                    1|                                                      1|                                          0|                                             0|                                                20|                                                               1|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|
|         1994|      1983|       Graduation|     Married|                            NaN|                        1|                     0|                            15-11-2013|                                             11|                                      5|                                       5|                                       6|                                        0|                                      2|                                     1|                                    1|                                                      1|                                          0|                                             2|                                                 7|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|
|          387|      1976|            Basic|     Married|                         7500.0|                        0|                     0|                            13-11-2012|                                             59|                                      6|                                      16|                                      11|                                       11|                                      1|                                    16|                                    1|                                                      2|                                          0|                                             3|                                                 8|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|
|         2125|      1959|       Graduation|    Divorced|                        63033.0|                        0|                     0|                            15-11-2013|                                             82|                                    194|                                      61|                                     480|                                      225|                                    112|                                    30|                                    1|                                                      3|                                          4|                                             8|                                                 2|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|
|         8180|      1952|           Master|    Divorced|                        59354.0|                        1|                     1|                            15-11-2013|                                             53|                                    233|                                       2|                                      53|                                        3|                                      5|                                    14|                                    3|                                                      6|                                          1|                                             5|                                                 6|                                                               0|                                                               0|                                                               0|                                                               0|                                                               0|                                                                       0|            3|       11|       0|

In [ ]:
esquema = (
    StructType([
        StructField("ID do cliente",StringType(), True),
        StructField("Nascimento", StringType(), True),
        StructField("Grau de instrução", StringType(), True),
        StructField("Estado Civil", StringType(), False),
        StructField("Renda Familiar Anual do Cliente", IntegerType(), True),
        StructField("Número de filhos pequenos", IntegerType(), True),
        StructField("Número de adolescentes", IntegerType(), True),
        StructField('Data do cadastro do cliente na empresa', StringType(), True),
        StructField('Número de dias desde a última compra do cliente', IntegerType(), True),
        StructField('Valor gasto em vinho nos últimos 2 anos', IntegerType(), True), 
        StructField('Valor gasto em frutas nos últimos 2 anos'),IntegerType(), True),
        StructField('Valor gasto em carnes nos últimos 2 anos', IntegerType(), True),
        StructField('Valor gasto em pescado nos últimos 2 anos ', IntegerType(), True),
        StructField('Valor gasto em doces nos últimos 2 anos', IntegerType(), True), 
        StructField('Valor gasto em ouro nos últimos 2 anos'),Integer(), True),
        StructField('Número de compras feitas com desconto', IntegerType(), True),
        StructField('Número de compras realizadas através do site da empresa  ', IntegerType(), True),
        StructField('Número de compras feitas usando um catálogo', IntegerType(), True),
        StructField('Número de compras feitas diretamente nas lojas', IntegerType(), True),
        StructField('Número de visitas ao site da empresa no último mês ', IntegerType(), True), 
        StructField('1 se o cliente aceitou a oferta na 3ª campanha, 0 caso contrário '),IntegerType(), True),
        StructField('1 se o cliente aceitou a oferta na 4ª campanha, 0 caso contrário '),IntegerType(), True),
        StructField('1 se o cliente aceitou a oferta na 5ª campanha, 0 caso contrário '),IntegerType(), True),
        StructField('1 se o cliente aceitou a oferta na 1ª campanha, 0 caso contrário '),IntegerType(), True),
        StructField('1 se o cliente aceitou a oferta na 2ª campanha, 0 caso contrário '),IntegerType(), True),
        StructField('Reclamação: 1 se o cliente reclamou nos últimos 2 anos, 0 caso contrário', IntegerType(), True),
        StructField('Z_CostContact', IntegerType(), True),
        StructField('Z_Revenue', IntegerType(), True),
        StructField('Resposta', IntegerType(), True),
    ])
)

In [ ]:
df = (
    spark
       .read
       .format("csv")
       .option("header", "true")
       .option("inferschema", "true")
       .option("delimiter", ";")
       .load("https://storage.googleapis.com/soulcodeprojeto/marketing_campaign.csv",schema=esquema)
)

In [ ]:
df.printSchema()

## 4 - NÍVEL SPARKSQL


A) Utilizar no minimo 5 consultas diferentes utilizando o SparkSQL, comentando o porquê de ter escolhido essas funções e explicando o que cada consulta faz.